Updates README with additional details and description
